package Java_3rd_Submission_Assignment;

// public class CarManu_suzuki {
//     public static String getsuzukiDescription() {
//         return "\r\nスズキは軽自動車に強い自動車メーカーとして知られています。\r\n"+"特に独自技術「S-エネチャージ」というモータ機能付発電機で加速をアシストすることで実現される、超低燃費に定評があります。\r\n"+"軽自動車で気になりがちな乗り心地もユーザーから高評価です。\r\n"+"また、軽自動車以外の普通車の評価も高く、「クロスビー」や「イグニス」などのヒット商品も送り出しています。"+"\r\n-----スズキの特徴的な車-----\r\n"+"・ジムニー・ジムニーシエラ・ハスラー・ワゴンR・エブリイ・ラパン・スイフトスポーツ・スイフト・スペーシア・アルト・アルトワークス\r\n";
//     }
// }

class CarManuSuzuki extends CarManufacturer{
    @Override
    public String getDescription() {
        return "スズキは軽自動車に強い自動車メーカーとして知られています。\r\n" + "特に独自技術「S-エネチャージ」というモータ機能付発電機で加速をアシストすることで実現される、超低燃費に定評があります。\r\n" + "軽自動車で気になりがちな乗り心地もユーザーから高評価です。\r\n" + "また、軽自動車以外の普通車の評価も高く、「クロスビー」や「イグニス」などのヒット商品も送り出しています。\r\n" + "\r\n\r\n-----スズキの特徴的な車-----\r\n" +"・ジムニー・ジムニーシエラ・ハスラー・ワゴンR・エブリイ・ラパン・スイフトスポーツ・スイフト・スペーシア・アルト・アルトワークス\r\n";
    }
}


