package kouka3;

// public class CarManu_lexas {
//     public static String getlexasDescription() {
//         return "レクサス車は高級感と先進技術の調和が特徴で、上質な素材と洗練されたデザインが特徴の内外装に表れ、驚くほどの静粛性と快適性を提供しています。\r\n"+"ハイブリッドテクノロジーを巧みに活用し、燃費効率に優れたパフォーマンスを発揮しています\r\n"+"ドライビングアシストシステムや豊富な先進テクノロジーが安全性と利便性を向上させ、職人技による高品質な製造が、クオリティの高さを際立たせています。"+"----レクサス車の特徴-----";
//     }
// }

// レクサスのメーカークラス
class CarManuLexus extends CarManufacturer{
    @Override
    public String getDescription() {
        return "\r\nレクサス車は高級感と先進技術の調和が特徴で、上質な素材と洗練されたデザインが特徴の内外装に表れ、驚くほどの静粛性と快適性を提供しています。\r\n" + "ハイブリッドテクノロジーを巧みに活用し、燃費効率に優れたパフォーマンスを発揮しています\r\n" +"ドライビングアシストシステムや豊富な先進テクノロジーが安全性と利便性を向上させ、職人技による高品質な製造が、クオリティの高さを際立たせています。\r\n"+"\r\n----レクサス車の特徴-----\r\n"+"・レクサスRX・レクサスNX・レクサスES・レクサスUX・レクサスIS・レクサスLS・レクサスLC・レクサスLFAがあります\r\n";
                
}
}
