package Java_3rd_Submission_Assignment;

class CarManuIsuzu {
    public static String getDescription() {
        return "\\r\\n" +
                "いすゞ自動車は商用車の分野で強力な存在であり、その特徴は頑丈で信頼性の高い車両です。\\r\\n" + 
                        "\"+\"主にトラックやバスといった商用車に焦点を当て、堅実な技術と優れた耐久性で知られています。\\r\\n" + 
                        "\"+\"燃費効率や積載能力に優れ、経済的かつ持続可能な輸送手段を提供します。\\r\\n" + 
                        "\"+\"安全性や快適性も考慮され、多岐にわたるビジネスニーズに対応しています。\\r\\n" + 
                        "\"+\"いすゞ自動車の車両は、プロフェッショナルなユーザーにとって頼りになる選択肢であり、厳しい商用利用にも十分に耐える実力を持っています。\"+\"\\r\\n" + //
                        "スバル車の特徴的な車\\r\\n" + 
                        "\"+\"・コモ・ビックホーン・ビークロス・ウィザード・ミュー・ジェミン・エルフトラック・フォワード・117クーペ・ピアッツア・ビークロスなどがある";
    }
}
