package Java_3rd_Submission_Assignment;

// class CarManu_subaru {
//     public static String getsubaruDescription() {
//         return "スバルの車は一般的に水平対向エンジン、またはボクサーエンジンを採用しています。\r\n"+"これはエンジンのシリンダーが水平に配置され、対向している特徴的な構造です。\r\n"+"この配置は低い重心を実現し、車両の安定性や操縦性を向上させる効果があります。"+"またスバルは安全性を重視し、先進的なドライビングアシストテクノロジーで知られています。\r\n"+"その中でも「アイサイト」は、車線逸脱警告、先行車追従、衝突回避支援など、さまざまな機能を組み合わせたシステムです。"+"\r\nスバル車の特徴的な車\r\n"+"・フォレスター・レヴォーグ・XV・インプレッサスポーツ・WRXS4・BRZ・レガシィアウトバック・ステラ・インプレッサG4・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・";
//     }
// }

class CarManuSubaru{
    public static String getDescription() {
        return "スバルの車は一般的に水平対向エンジン、またはボクサーエンジンを採用しています。\\r\\n" + //
                "\"+\"これはエンジンのシリンダーが水平に配置され、対向している特徴的な構造です。\\r\\n" + //
                "\"+\"この配置は低い重心を実現し、車両の安定性や操縦性を向上させる効果があります。\"+\"またスバルは安全性を重視し、先進的なドライビングアシストテクノロジーで知られています。\\r\\n" + //
                "\"+\"その中でも「アイサイト」は、車線逸脱警告、先行車追従、衝突回避支援など、さまざまな機能を組み合わせたシステムです。\"+\"\\r\\n" + //
                "スバル車の特徴的な車\\r\\n" + //
                "\"+\"・フォレスター・レヴォーグ・XV・インプレッサスポーツ・WRXS4・BRZ・レガシィアウトバック・ステラ・インプレッサG4";
    }
}

