package Java_3rd_Submission_Assignment;

// class CarManu_nissan {
//     public static String getNissanDescription() {
//         return "日産といえば「技術の日産」を掲げるように先進技術に重きを置き、常に新しい技術をいち早く世に出してきた自動車メーカー。\r\n"+"現在、半自動運転の技術は日本の自動車メーカーの中でもトップクラスです。\r\n"+"また、国内では数少ない完全電気自動車の「リーフ」や、国内で製造される車の中でも唯一スーパーカーと呼ばれる「GT-R」など個性的な車も展開しています。"+"\r\n------ニッサンの代表的な車-----\r\n"+"・ノート・セレナ・デイズ・ルークス・エクストレイル・SAKURS・リーフ・マーチ・GT-R・フェアレディZなどがあります\r\n";
//     }
// }

class CarManuNissan{
    public static String getDescription() {
        return "日産といえば「技術の日産」を掲げるように先進技術に重きを置き、常に新しい技術をいち早く世に出してきた自動車メーカー。\r\n" + "現在、半自動運転の技術は日本の自動車メーカーの中でもトップクラスです。\r\n" + "また、国内では数少ない完全電気自動車の「リーフ」や、国内で製造される車の中でも唯一スーパーカーと呼ばれる「GT-R」など個性的な車も展開しています。\r\n" + "\r\n------ニッサンの代表的な車-----\r\n" + "・ノート・セレナ・デイズ・ルークス・エクストレイル・SAKURS・リーフ・マーチ・GT-R・フェアレディZなどがあります\r\n" ;
    }
}










